app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "編集済み"], ["updated_at", "2020-04-27 10:51:44.280428"], ["id", 4]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "あ"], ["body", "あ"], ["created_at", "2020-04-29 06:11:26.609810"], ["updated_at", "2020-04-29 06:11:26.609810"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    if @book.save
      flash[:notice] = "Book was successfully created."
      redirect_to  book_path(@book.id)
    else
      @books = Book.all