app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "初投稿"], ["body", "初投稿です。"], ["created_at", "2020-04-27 07:51:10.705799"], ["updated_at", "2020-04-27 07:51:10.705799"]]
---
  def create
    book = Book.new(book_params)
    if book.save